---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Current
source: html/1e741eb8-f928-1507-df81-1b2eb777fc8a.htm
---
# Autodesk.Revit.DB.SpecTypeId.Current Property

Current, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId Current { get; }
```